Revit 2024 API
ExternalServices.BuiltInExternalServices.ExternalUIService Property
 Unique service id.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ExternalUIService { get; }
Visual Basic
Public Shared ReadOnly Property ExternalUIService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ExternalUIService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace